crates/service/src/test/get-response-windows.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:pub="http://schemas.microsoft.com/windows/pub/2005/07"
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:un0="http://schemas.microsoft.com/windows/pnpx/2005/10"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof"
    xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
>
    <soap:Header>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action>
        <wsa:MessageID>urn:uuid:{}</wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:{}</wsa:RelatesTo>
    </soap:Header>
    <soap:Body>
        <wsx:Metadata>
            <wsx:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/ThisDevice">
                <wsdp:ThisDevice>
                    <wsdp:FriendlyName>Microsoft Publication Service Device Host</wsdp:FriendlyName>
                    <wsdp:FirmwareVersion>1.0</wsdp:FirmwareVersion>
                    <wsdp:SerialNumber>20050718</wsdp:SerialNumber>
                </wsdp:ThisDevice>
            </wsx:MetadataSection>
            <wsx:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/ThisModel">
                <wsdp:ThisModel>
                    <wsdp:Manufacturer>Microsoft Corporation</wsdp:Manufacturer>
                    <wsdp:ManufacturerUrl>http://www.microsoft.com</wsdp:ManufacturerUrl>
                    <wsdp:ModelName>Microsoft Publication Service</wsdp:ModelName>
                    <wsdp:ModelNumber>1</wsdp:ModelNumber>
                    <wsdp:ModelUrl>http://www.microsoft.com</wsdp:ModelUrl>
                    <wsdp:PresentationUrl>http://www.microsoft.com</wsdp:PresentationUrl>
                    <un0:DeviceCategory>Computers</un0:DeviceCategory>
                </wsdp:ThisModel>
            </wsx:MetadataSection>
            <wsx:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/Relationship">
                <wsdp:Relationship Type="http://schemas.xmlsoap.org/ws/2006/02/devprof/host">
                    <wsdp:Host>
                        <wsa:EndpointReference>
                            <wsa:Address>urn:uuid:38deb0ef-b101-44f7-8eb3-f4466e1eef0c</wsa:Address>
                        </wsa:EndpointReference>
                        <wsdp:Types>pub:Computer</wsdp:Types>
                        <wsdp:ServiceId>urn:uuid:a55e9628-96d5-4cb0-89db-6214763a422c</wsdp:ServiceId>
                        <pub:Computer>LAPTOP-TEST/Workgroup:WORKGROUP</pub:Computer>
                    </wsdp:Host>
                </wsdp:Relationship>
            </wsx:MetadataSection>
        </wsx:Metadata>
    </soap:Body>
</soap:Envelope>
